
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/tentuku10/aws-ecs-terraform/actions/runs/4518685167)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0278fc0070a502a87]
data.aws_iam_policy_document.ecs_assume: Reading...
data.aws_iam_policy_document.ecs_task_assume: Reading...
aws_ecr_repository.ecr_repository: Refreshing state... [id=go-app]
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=320642683]
aws_cloudwatch_log_group.cloudwatch_log_group: Refreshing state... [id=/aws/ecs/go-app]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-063f1b3398ef3436e]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:635808309755:cluster/go-app]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0312363f840ed32db]
data.aws_iam_policy_document.ecs_assume: Read complete after 0s [id=320642683]
aws_iam_role.ecs_task: Refreshing state... [id=go-app-ecs-task]
aws_iam_role.ecs: Refreshing state... [id=go-app-ecs]
aws_iam_role_policy_attachment.ecs_basic: Refreshing state... [id=go-app-ecs-20230325100046427000000001]
aws_ecr_lifecycle_policy.ecr_lifecycle_policy: Refreshing state... [id=go-app]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e3c37a3581b6687d]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0af9cf614a51dcacc]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f062c3f08f6c956d]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0307139f37e6298a4]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-033690c6548d62613]
aws_security_group.ecs: Refreshing state... [id=sg-0bbafcedff85edc6f]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-02846bfbfc65dfced]
aws_security_group.alb: Refreshing state... [id=sg-055b6e15e06b167b9]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0d51ee8b7132b0410]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05bcf52febed18f77]
aws_lb_target_group.target_group: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:targetgroup/go-app-target-group/721e8662c3cc56d0]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-030c658c088747c74]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-004be7179a24dcc16]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-013217273682e9add]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-0f562c8585bb5a0cc]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-03952cd353f2e41f7]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02846bfbfc65dfced1080289494]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b2a6d187f62a1ecb]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1809363762]
aws_lb.alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:loadbalancer/app/go-app-alb/7d090edf7111de88]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-033690c6548d626131080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0307139f37e6298a41080289494]
aws_lb_listener.alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a]
aws_lb_listener_rule.alb_listener_rule: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:listener-rule/app/go-app-alb/7d090edf7111de88/6b32ffc2b370331a/36d25c4bfc8945e0]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_service.ecs_service will be created
  + resource "aws_ecs_service" "ecs_service" {
      + cluster                            = "arn:aws:ecs:ap-northeast-1:635808309755:cluster/go-app"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 100
      + desired_count                      = 2
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "go-app"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "go-app"
          + container_port   = 8080
          + target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:635808309755:targetgroup/go-app-target-group/721e8662c3cc56d0"
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = [
              + "sg-0bbafcedff85edc6f",
            ]
          + subnets          = [
              + "subnet-0af9cf614a51dcacc",
              + "subnet-0f062c3f08f6c956d",
            ]
        }
    }

  # aws_ecs_task_definition.ecs_task_definition will be created
  + resource "aws_ecs_task_definition" "ecs_task_definition" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "HEALTH_CHECK_PATH"
                          + value = "/health_checks"
                        },
                      + {
                          + name  = "NGINX_PORT"
                          + value = "8080"
                        },
                    ]
                  + image            = "medpeer/health_check:latest"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "/aws/ecs/go-app"
                          + awslogs-region        = "ap-northeast-1"
                          + awslogs-stream-prefix = "go-app"
                        }
                    }
                  + name             = "go-app"
                  + portMappings     = [
                      + {
                          + containerPort = 8080
                          + hostPort      = 8080
                        },
                    ]
                },
            ]
        )
      + cpu                      = "256"
      + execution_role_arn       = "arn:aws:iam::635808309755:role/go-app-ecs"
      + family                   = "go-app"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = (known after apply)
      + task_role_arn            = "arn:aws:iam::635808309755:role/go-app-ecs-task"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
aws_ecs_task_definition.ecs_task_definition: Creating...
aws_ecs_task_definition.ecs_task_definition: Creation complete after 1s [id=go-app]
aws_ecs_service.ecs_service: Creating...
aws_ecs_service.ecs_service: Creation complete after 1s [id=arn:aws:ecs:ap-northeast-1:635808309755:service/go-app/go-app]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"155f384e2923d8b496a6f67e11f99364c6a896a6","Vars":{},"WorkflowName":"Terraform"} -->